# NoFlatCurtainRoofs Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoofFailures..::..NoFlatCurtainRoofs Property
BuiltInFailures..::..RoofFailures Class See Also
---
A Sloped Glazing with no slope is not allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoFlatCurtainRoofs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoFlatCurtainRoofs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoFlatCurtainRoofs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoofFailures Class
Autodesk.Revit.DB Namespace